<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html><head>
<title>Paths</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->


<h1>Paths</h1>

In giochi pi&ugrave; avanzati spesso vorrai che le istanze seguano determinati percorsi.
Anche se puoi indicarli ad esempio usando degli eventi Alarm o il codice, &egrave;
piuttosto complesso. La risorsa Path (percorso) &egrave; un meccanismo pi&ugrave; facile per
fare ci&ograve;. L'idea &egrave; piuttosto semplice. Definisci un path disegnando un percorso.
Poi puoi inserire un'azione nel Create Event di un object che gli dica di seguire
quel path. Questo capitolo spiegher&agrave; tutto nel dettaglio.



<h3>Definire i path</h3>

Per creare un path nel tuo gioco, scegli <b>Create Path</b> (Crea Path) dal menu <b>Resources</b>.
Apparir&agrave; questa finestra (nell'esempio abbiamo gi&agrave; aggiunto un piccolo path).

<p>
<img src="images/form_path.jpg">

<P>
In alto a destra puoi impostare il nome del path, come al solito. Sotto
si trovano i punti che definiscono il path. Ogni punto ha una posizione
e una velocit&agrave; (sp). A seconda di come usi il path, la posizione pu&ograve;
essere assoluta, cio&egrave; l'istanza andr&agrave; in quello specifico posto, o relativa,
cio&egrave; l'istanza comincia alla prima posizione del path e lo segue dalla sua
posizione corrente. La velocit&agrave; va interpretata come segue. Il valore 100
indica che viene usata la velocit&agrave; del path quando viene assegnato all'istanza.
un valore minore riduce la velocit&agrave;, un valore maggiore la aumenta (in sintesi,
indica la percentuale della velocit&agrave; assegnata all'istanza), La velocit&agrave;
viene interpolata tra i pixel, quindi la velocit&agrave; cambier&agrave; gradualmente.

<P>
Per aggiungere un punto clicca su <B>Add</B> (agguingi). Viene fatta una copia
del punto selezionato. Ora puoi modificare posizione e velocit&agrave;cambiando i
valori nei campi di inserimento. Puoi cambiare i valori di qualsiasi punto
della lista selezionandolo. Clicca su <B>Insert</B> (inserisci) Per inserire
un nuovo punto prima di quello selezionato, e <B>Delete</B> (elimina) per
cancellare il punto selezionato. 

<P>
Sulla destra puoi vedere il path. Il punto rosso indica il punto di controllo
attualmente selezionato. I punti blu sono gli altri punti. Il quadratino verde
indica il punto di partenza del path. Puoi cambiare il path anche col mouse.
Clicca ovunque per aggiungere un punto. Clicca su un punto esistente e trascinalo
per cambiarne la posizione. Se tieni premuto &lt;Shift&gt; mentre clicchi su
un punto, puoi inserirne uno (prima di quello appena cliccato). Infine, puoi
usare il tasto destro per rimuovere i punti. (Nota che non puoi cambiare la
velocit&agrave; in questo modo.) Normalmente i punti verranno allineati con una griglia.
Puoi cambiare le impostazioni della griglia nella barra degli strumenti in alto.
Qui puoi anche indicare se mostrare o meno la griglia. Se vuoi piazzare con
precisione un punto, tieni premuto &lt;Alt&gt; mentre lo sposti per ignorare
la griglia.

<P>
Puoi influenzare la forma del path in due modi. Primo, puoi scegliere il tipo
di connessione. Puoi usare linee dritte o linee curve e smussate. Secondo,
puoi indicare se il path deve essere chiuso o no.

<P>
Nella barra degli strumenti si trovano dei comandi importanti. Eccone la
descrizione da sinistra a destra. Il primo pulsante salva e chiude la finestra.
(Se vuoi chiudere senza salvare, clicca sul pulsante Chiudi della finestra
e indica di non voler salvare.) Accanto c'&egrave; il pulsante per annullare
l'ultima azione.

<p>
Il set di comandi seguente ti permette di cancellare tutto, invertire il
senso di marcia del path, spostarlo per intero, capovolgerlo orizzontalmente
o verticalmente, ruotarlo, ingrandirlo/rimpicciolirlo. Accanto ci sono i
pulsanti per spostare la visuale (e non il path stesso, l'area coperta dalla
visuale &egrave; indicata dalla barra di stato in basso) e centrarla.&nbsp; Puoi anche
usare il bottone centrale del mouse per fare una panoramica attorno al path.

<P>
Come gi&agrave; indicato sopra puoi impostare la griglia e decidere se mostrarla o no.
Infine c'&egrave; un pulsante che ti permette di impostare una room specifica come
sfondo, cos&igrave; potrai mettere il path in un punto particolare della room, ad
esempio su un circuito per le corse, in modo che le istanze seguano il percorso
giusto. (Ha senso solo se usi la posizione assoluta, vedi sotto.)



<h3>Assegnare i path agli object</h3>

Per assegnare un path a un'istanza di un object, puoi mettere l'azione pat
in un evento, per esempio in quello Create. In quest'azione devi specificare
il path dal menu a tendina. Ci sono anche altri valori che puoi fornire.

<P>
Devi indicare il path da seguire e la velocit&agrave; in pixel per step. Se la velocit&agrave;
&egrave; positiva l'istanza comincia dall'inizio del path, altrimenti comincia dalla fine.
Ricorda che quando hai definito il path hai specificato per ogni punto la velocit&agrave;
relativa a questa che stai fornendo adesso. C'&egrave; anche un'azione per cambiare la
velocit&agrave; di un path mentre &egrave; in esecuzione. Puoi usarla, per esempio, per farla
accelerare o rallentare durante il percorso. Nota che la velocit&agrave; normale dell'istanza
viene ignorata (impostata a 0) durante l'esecuzione del path. Anche cose come
gravit&agrave; e attrito non influenzano il movimento lungo il path.

<P>
Puoi va specificato il comportamento alla fine, cio&egrave; cosa succede quando l'istanza
raggiunge la fine del path. Puoi scegliere di fermare il movimento e terminare
il path; o di ricominciare il path da capo, vale a dire, l'istanza salta alla
posizione iniziale ed esegue il path dall'inizio. Una terza opzione consiste
nel ricominciare dalla posizione corrente, cio&egrave; l'istanza segue il path di nuovo
ma partendo dalla sua nuova posizione (&egrave; lo stesso se il path &egrave; chiuso); infine
puoi scegliere di invertire il movimento, facendo andare l'istanza avanti e indietro
sul path. Nota che alla fine di un path si verifica anche un evento; vedi a fine pagina.

<P>
Infine puoi indicare se il path deve essere assoluto o relativo. Un path assoluto
viene eseguito nel posto in cui &egrave; definito. L'istanza &egrave; piazzata nella posizione
iniziale (finale se la velocit&agrave; &egrave; negativa) e si muove da l&igrave;. Questo &egrave; utile, per
esempio, quando hai un tracciato di gara su cui hai definito il path. Se invece
&egrave; relativo le istanze cominciano l'esecuzione del path dalla loro posizione corrente.
Torna utile quando un'istanza deve fare un movimento locale. Ad esempio, delle
astronavi in un gioco a tema spaziale potrebbero fare una virata particolare
partendo dalla loro posizione corrente.

<P>
Quando vuoi piazzare un'istanza in un punto diverso lungo il path puoi usare
l'azione per impostare la posizione del path. Il numero reale da inserire deve
essere compreso tra 0 e 1, dove 0 &egrave; la posizione iniziale e 1 &egrave; la posizione
finale. Nota che in ogni step la direzione (variabile direction) viene impostata
automenticamente alla direzione corretta lungo il path. Puoi usare questa
variabile per scegliere il giusto orientamento dello sprite.

<P>
Quando usi gli script o il codice hai un maggiore controllo sul modo in cui
il path viene eseguito. C'&egrave; una funzione (path_start) per far partire un path
per l'istanza. La variabile <TT>path_position</TT> indica la posizione corrente
all'interno del path (compresa tra 0 e 1, vedi sopra). La variabile <TT>path_speed</TT>
indica la velocit&agrave; nel path. <TT>path_scale</TT> pu&ograve; essere usata per rendere
il path pi&ugrave; grande o pi&ugrave; piccolo. 1 &egrave; la dimensione originale. Un valore
maggiore indrandisce il path; uno minore lo rimpicciolisce. La variabile
<TT>path_orientation</TT> serve a ruotare il path (0=posizione originaria,
misura in gradi, senso antiorario). Questo ti permette di orientare il path in
direzioni diverse (ad esempio per muoversi su e gi&ugrave; anzich&eacute; a sinistra e a destra).
C'&egrave; anche una variabile per controllare il comportamento alla fine (path_endaction).
Infine ci sono tantissime funzioni per ottenere le propriet&agrave; del path (ad esempio
le coordinate x e y in determinate posizioni) e ci sono funzioni per creare path.
Ci sono persino funzioni per creare dei percorsi liberi da collisioni in modo
che un'istanza possa raggiungere un obiettivo. Vedi la sezione sul GML per
maggiori dettagli.

<P>
Ti chiederai cosa succede se l'istanza collide con un'altra mentre segue un path.
Basilarmente succede la stessa cosa di quando si muove normalmente. Se c'&egrave;
un'istanza solida, l'istanza &egrave; piazzata alla posizione precedente, se nessuna
delle due lo &egrave; vengono piazzate alle nuove posizioni. Poi vengono eseguiti i
Collision Event e si controlla se la collisione &egrave; stata risolta. Se non lo &egrave;
e l'altra istanza &egrave; solida l'istanza si fermer&agrave; (tutto questo supponendo che
sia stato impostato un Collision Event).Inoltre, la variabile <TT>path_position</TT>
non viene incrementata. Per gestirti le collisioni da solo ti torner&agrave; utile
la variabile <TT>path_positionprevious</TT>. Contiene la posizione precedente nel path
e puoi impostare la posizione nel path a questo valore per evitare di avanzare
lungo il path.



<h3>L'evento del path</h3>

Come descritto sopra, puoi indicare cosa succede quando l'istanza raggiunge
la fine del path. In questo momento si innesca anche l' evento <b>End of Path</b>
(fine del path). Puoi trovarlo sotto <b>Other</b>. Qui puoi mettere delle azioni.
Ad esempio, vorrai distruggere l'istanza, o farle seguire un path diverso.

<!--END-->
</body>
</html>

<!-- KEYWORDS
adding paths
creating paths
paths
path on room image
setting paths
path index
path orientation
path scale
path position
path end behavior
end of path event
smooth paths
aggiungere path
creare path
percorsi
path sull'immagine della room
impostare i path
path, indice
path, orientamento
path, ingrandimento/rimpicciolimento
path, posizione
path, comportamento finale
End Of Path, evento
path smussato
--> 
