 <!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Varie Altre Opzioni</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->

<h3>Varie Altre Opzioni</h3>

Qui puoi impostare alcune opzioni addizzionali. Prima di tutto puoi impostare qualche tasto predefinito:

<p>
<b>Let &lt;Esc&gt; end the game</b><br>
<i>Lascia che &lt;Esc&gt; termini il gioco</i>
Quando &egrave; spuntato, premere &lt;Esc&gt; causer&agrave; la chiusura del gioco. I giochi avanzati
di solito non lo vogliono perch&eacute; vorrebbero fare qualcosa (come salvare) prima di chiudere
il gioco. In questo caso, leva il segno di spunta e dai le tue azioni per il tasto &lt;Esc&gt;.

<p>
<b>Treat the close button as &lt;Esc&gt; key</b><br>
<i>Tratta il pulsante Chiudi come il tasto &lt;Esc&gt;</i>
Quando &egrave; spuntato il pulsante Chiudi sulla finestra genera un &lt;Esc&gt; Key Event.
Quando NON &egrave; spuntato genera invece un Close Button Event (sotto Other Events).

<p>
<b>Let &lt;F1&gt; show the game information</b><br>
<i>Lascia che &lt;F1&gt; mostri le informazioni del gioco</i>
Quando &egrave; spuntato F1 mostrer&agrave; le informazioni del gioco.

<p>
<b>Let &lt;F4&gt; switch between screen modes</b><br>
<i>Lascia che &lt;F4&gt; scambi tra le modalit&agrave; dello schermo</i>
Quando &egrave; spuntato F4 scambier&agrave; tra le modalit&agrave; schermo intero e finestra.

<p>
<b>Let &lt;F5&gt; save the game and &lt;F6&gt; load a game</b><br>
<i>Lascia che &lt;F5&gt; salvi il gioco e che &lt;F6&gt; lo carichi</i>
Quando &egrave; spuntato il giocatore pu&ograve; usare &lt;F5&gt; per salvare la
situazione corrente e &lt;F6&gt; per caricare l'ultimo gioco salvato.
(Nota che vengono salvate solo le informazioni di base. Quando usi
funzionalit&agrave; avanzate come gli effetti particellari o le strutture di dati
queste impostazioni non vengono salvate e dovrai crearti da solo un meccanismo
di salvataggio.)

<p>
<b>Let &lt;F9&gt; take a screenshot of a game</b><br>
<i>Lascia che &lt;F9&gt; prenda un'istantanea del gioco</i>
Quando &egrave; spuntato il giocatore pu&ograve; premere &lt;F9&gt; per creare un'istantanea
del gioco. Quest'istantanea viene salvata nel file screenshotXXX.png nella
cartella da cuiil gioco sta venendo eseguito, dove XXX &egrave; il numero dell'istantanea.
Se crei pi&ugrave; istantanee il numero viene incrementato automaticamente.

<p>
Puoi anche impostare la priorit&agrave; del processo del gioco. La priorit&agrave; indica quanto
tempo del processore viene dedicato al gioco. In modalit&agrave; normale il sistema operativo
prova a dare il tempo del processore a tutti i processi che lo richiedono in modo
ragionevole. Pi&ugrave; la priorit&agrave; del gioco &egrave; alta, pi&ugrave; tempo gli viene dedicato, in modo
che venga eseguito meglio e pi&ugrave; velocemente. Ma gli altri processi ricevono meno tempo
(anche i processi di Windows, quindi pure il mouse potrebbe smettere di muoversi).
Usala con cautela.

<p>
Infine, puoi impostare le informazioni della versione. queste informazioni vengono mostrate
nella casellina che compare quando l'utente tiene fermo il mouse sull'eseguibile del gioco.
Vengono mostrate anche quando l'utente clicca col tasto destro del mouse sul programma
e sceglie Propriet&agrave; e poi Versione. Se vuoi pubblicare il tuo gioco farai bene a
inserire queste informazioni.

<p>
Devi dare al tuo gioco un numero di versione diviso in quattro parti: la versione maggiore,
la versione minore, il numero del rilascio e il numero della costruzione. (Queste sono
traduzioni letterali, le definizioni inglesi sono: major, minor, release, build.)
Devi anche fornire il nome della compagnia (tu), il nome del prodotto, le informazioni
sul copyright e una descrizione molto breve. Tutti questi campi non devono superare
i 64 caratteri.

<!--END-->
</body>
</html>

<!-- KEYWORDS
special keys
priority
tasti speciali
priorit&agrave;
--> 
