<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Muoversi attorno</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->

<h3>Muoversi attorno</h3>

Ovviamente, un aspetto importante dei giochi &egrave; il movimento delle istanze degli oggetti.
Ogni istanza ha due variabili built-in, x e y, che indicano la posizione
dell'istanza. (Per essere pi&ugrave; precisi, indicano il punto in cui l'orgiine dello sprite
si trova). La posizione (0,0) &egrave; l'angolo in alto a sinistra della room. Puoi cambiare
la posizione di un'istanza cambiando le sue variabili x e y. Se vuoi
far fare dei movimenti complicati all'oggetto questo &egrave; il modo per farlo. Di solito
metti questo codice nell'evento Step.

<p>
Se l'oggetto si muove con velocit&agrave; e direzione costante, c'&egrave; un modo pi&ugrave;
semplice per fare ci&ograve;. Ogni istanza ha una velocit&agrave; orizzontale (<tt>hspeed</tt>)
e una verticale (<tt>vspeed</tt>). Entrambe hanno come unit&agrave; di misura il pixel per step.
Una velocit&agrave; orizzontale positiva indica un moto verso destra, una negativa
verso sinistra. Una velocit&agrave; verticale positiva indica un movimento verso il basso
e una negativa verso l'alto. Quindi devi impostare queste variabili solo
una volta (per esempio nell'evento Create) per dare all'istanza un movimento costante.

<p>
C'&egrave; un altro modo un po' diverso per specificare il movimento, usando una
direzione espressa in gradi, e una velocit&agrave; non-negativa. Puoi impostare
e leggere queste variabili per specificare un movimento arbitrario. (Internamente
viene cambiato in valori per le variabili <tt>h/vspeed</tt>). Inoltre
c'&egrave; la frizione, la gravit&agrave; e la sua direzione. Infine, 
c'&egrave; la funzione <tt>motion_add(dir,speed)</tt> per aggiungere un movimento
all'istanza corrente.

<p>
Per essere pi&ugrave; precisi, ogni istanza possiede le seguenti variabili e funzioni
che trattano con la posizione e il movimento:

<p>
<blockquote>
  <tt><b>x</b></tt>
	La sua ascissa.<br>
  <tt><b>y</b></tt>   
	La sua ordinata.<br>
  <tt><b>xprevious</b></tt>   
	L'ascissa precedente.<br>
  <tt><b>yprevious</b></tt>   
	L'ordinata precedente.<br>
  <tt><b>xstart</b></tt>   
	L'ascissa iniziale nella room.<br>
  <tt><b>ystart</b></tt>   
	L'ordinata iniziale nella room.<br>
  <tt><b>hspeed</b></tt>   
	La componente orizzontale della velocit&agrave;.<br>
  <tt><b>vspeed</b></tt>   
	La componente verticale della velocit&agrave;.<br>
  <tt><b>direction</b></tt>
	La direzione (0-360, in senso antiorario, 0 = destra).<br>
  <tt><b>speed</b></tt>
	La velocit&agrave; corrente (pixel / step).<br>
  <tt><b>friction</b></tt>
	La frizione corrente (pixel / step).<br>
  <tt><b>gravity</b></tt>
	La quantit&agrave; attuale di gravit&agrave; (pixel / step).<br>
  <tt><b>gravity_direction</b></tt>
	Direzione della gravit&agrave; (270 = verso sotto).<br>
  <tt><b>motion_set(dir,speed)</b></tt>
	Imposta il movimento con la velocit&agrave; e la direzione data.<br>
  <tt><b>motion_add(dir,speed)</b></tt>
	Aggiunge il movimento a quello attuale (&egrave; una somma tra vettori).<br>
</blockquote>

<p>
Ci sono molte funzioni disponibili che ti permettono di definire i tuoi movimenti:

<p>
<blockquote>
  <tt><b>place_free(x,y)</b></tt>
	Restituisce true se l'istanza, piazzata alla posizione (x,y), sarebbe libera da collisioni.
	Questo &egrave; usato tipicamento per fare un controllo prima di spostarla realmente in quella posizione.<br>
  <tt><b>place_empty(x,y)</b></tt>
	Restituisce true se l'istanza, piazzata alla posizione (x,y), non incontra nessuno.
	Quindi questa funzione considera anche gli oggetti non solid.<br>
  <tt><b>place_meeting(x,y,obj)</b></tt>
	Restituisce true se l'istanza, piazzata alla posizione (x,y), incontrerebbe l'oggetto obj.
	obj pu&ograve; essere un oggetto nel caso in cui la funzione restituisce true
	se un istanza di quell'oggetto viene incontrata. Pu&ograve; anche essere l'id di un'istanza, 
	mentre "all" indica qualunque istanza di qualunque oggetto, oppure si pu&ograve; usare "other".<br>
  <tt><b>place_snapped(hsnap,vsnap)</b></tt>
    Returns whether the instance is aligned with the snapping values.<br>
	Restituisce true se l'istanza &egrave; allineata con i valori dello snapping.<br>
  <tt><b>move_random(hsnap,vsnap)</b></tt>
	Sposta l'istanza in una posizione casuale libera, come l'azione corrispondente.
  <tt><b>move_snap(hsnap,vsnap)</b></tt>
	Allinea l'istanza, come l'azione corrispondente.<br>
  <tt><b>move_wrap(hor,vert,margin)</b></tt>
	Teletrasporta l'istanza nel lato opposto quando esce dal limite della room. <tt>hor</tt>
	indica se spostare orizzontalmente e <tt>vert</tt> verticalmente.
	<tt>margin</tt> indica quando dev'essere lontana l'origine
	dell'istanza affinch&eacute; avvenga lo spostamento. Quindi &egrave;
	il margine attorno alla room. Di solito si usa questa funzione nell'evento
	Outside.<br>
  <tt><b>move_towards_point(x,y,sp)</b></tt>
	Muove l'istanza con la velocit&agrave; "sp" verso la posizione (x,y).<br>
  <tt><b>move_bounce_solid(adv)</b></tt>
	Rimbalza contro le istanze solide, come fa l'azione corrispondente.
	adv indica se bisogna utilizzare il rimbalzo avanzato, che tiene conto anche dei muri inclinati.<br>
  <tt><b>move_bounce_all(adv)</b></tt>
	Rimbalza contro tutte le istanze, anche con quelle non solide.<br>
  <tt><b>move_contact_solid(dir,maxdist)</b></tt>
	Muove l'istanza verso una direzione finch&eacute; non entra in contatto con un solido.
	Se non c'&egrave; collisione alla posizione corrente, 
	l'istanza viene piazzata appena prima che la collisione avvenga. Se c'&egrave; gi&agrave; una collisione
	l'istanza non viene spostata. Puoi specificare la distanza massima
	da percorrere (usa un numero negativo per una distanza arbitraria).<br>
  <tt><b>move_contact_all(dir,maxdist)</b></tt>
	Simile alla funzione precedente, ma si ferma a contatto con
	qualunque oggetto, anche non solido.<br>
  <tt><b>move_outside_solid(dir,maxdist)</b></tt>
	Sposta l'istanza verso una direzione finch&eacute; non giace pi&ugrave; all'interno di un oggetto solido.
	Se non c'&egrave; collisione alla posizione corrente l'istanza non viene spostata.
	Puoi specificare la massima distanza da percorrere (negativa = distanza arbitraria).
	<br>
  <tt><b>move_outside_all(dir,maxdist)</b></tt>
	Simile alla funzione precedente, ma considera anche gli oggetti non solidi.
	<br>
  <tt><b>distance_to_point(x,y)</b></tt>
	Restituisce la distanza tra la bounding box dell'istanza corrente alla posizione (x,y). (Se l'istanza
	non ha uno sprite o una mask, il risultato della funzione non &egrave; definito.)<br>
  <tt><b>distance_to_object(obj)</b></tt>
	Restituisce la distanza dall'istanza verso l'istanza pi&ugrave; vicina dell'oggetto obj. (Se l'istanza
	o l'oggetto non hanno uno sprite o una mask, il risultato non &egrave; definito).<br>
  <tt><b>position_empty(x,y)</b></tt>
	Restituisce true se non c'&egrave; niente alla posizione (x,y).<br>
  <tt><b>position_meeting(x,y,obj)</b></tt>
	Restituisce true se alla posizione (x,y) c'&egrave; l'istanza obj. obj pu&ograve; essere un oggetto, un'istanza
	o le keywords <tt>self</tt>, <tt>other</tt>, o <tt>all</tt>.<br>
</blockquote>


<!--END-->
</body>
</html>

<!-- KEYWORDS
motion
distance
moving
instance variables
positions
movimento
moto
distanza
muoversi
variabili d'istanza
posizioni

x
y
xprevious
yprevious
xstart
ystart
hspeed
vspeed
direction
direzione
speed
velocit&agrave;
friction
frizione
gravity
gravit&agrave;
gravity_direction
direzione della gravit&agrave;
motion_set()
motion_add()
place_free()
place_empty()
place_meeting()
place_snapped()
move_random()
move_snap()
move_wrap()
move_towards_point()
move_contact_solid()
move_contact_all()
move_outside_solid()
move_outside_all()
move_bounce_solid()
move_bounce_all()
distance_to_point()
distance_to_object()
position_empty()
position_meeting()

--> 

