<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Motion planning</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->

<h3>Motion planning</h3>

La pianificazione del movimento (Motion Planning) ti aiuta a muovere certe istanze da una data posizione
ad una differente evitando collisioni con certe altre istanze
(es. muri). La pianificazione del movimento (Motion Planning) rappresenta un problema. E' impossibile
fornire funzioni generali che lavorino correttamente in tutte le circostanze. Inoltre,
calcolare movimenti liberi da collisioni &egrave; un'operazione che richiede tempo. Per questo devi
prestare attenzione a come e quando la applichi. Per favore tieni a mente queste osservazioni quando
utilizzi una delle seguenti funzioni.

<P>
Vengono messe a disposizione differenti forme di pianificazione del movimento (Motion Planning) da <i>GameMaker</i>.
La forma pi&ugrave; semplice consente ad un'istanza di fare un passo verso una particolare posizione
obbiettivo, cercando di andare dritto se possibile ma prendendo una direzione differente
se necessario. Queste funzioni dovrebbero essere usate nell'evento passo (step) di un'istanza.
Ecco la serie di funzioni disponibili per il motion planning:

<p>
<blockquote>
  <tt><b>mp_linear_step(x,y,stepsize,checkall)</b></tt>
    Questa funzione consente all'istanza di fare un passo dritto verso la posizione
    indicata (x,y). La dimensione del passo (dello spostamento) &egrave; indicata da <TT>stepsize</TT> (dimensione del passo).
	Se l'istanza si trova gi&agrave; nella posizione non si sposter&agrave; ulteriormente.
	Se <TT>checkall</TT> (controllare tutto) assume il valore di vero (true) l'istanza si fermer&agrave; quando urti un'istanza
	di qualunque oggetto. Se assume il valore di falso (false) si fermer&agrave; soltanto quando stia urtando un istanza solida (di tipo: solid).
	Nota che questa funzione non prova a fare deviazioni se incontra un ostacolo.
	Essa semplicemente fallir&agrave;. La funzione restituisce se sia stata o meno raggiunta la
	posizione meta (obbiettivo).<br>
	
  <tt><b>mp_linear_step_object(x,y,stepsize,obj)</b></tt>
    Come la funzione sopra ma questa volta soltanto le istanze di <tt>obj</tt> sono&ugrave;
    considerate come ostacoli. <tt>obj</tt> pu&ograve; essere un oggetto o l'identificativo (id) di un'istanza.<br>
		
  <tt><b>mp_potential_step(x,y,stepsize,checkall)</b></tt>
    Come la precedente funzione, questa consente all'istanza di fare un passo verso
    una particolare posizione. Ma in questo caso essa prova ad evitare gli ostacoli. Quando 
	l'istanza incontrasse un'istanza solida (solid) (o qualunque istanza quando 'checkall' assumesse il valore 'true')
	essa cambier&agrave; la direzione del movimento per tentare di evitare l'istanza e
	aggirarla. L'approccio non garantisce di funzionare ma in molti casi semplici esso
	effettivamente muover&agrave; l'istanza verso la meta (obbiettivo). La funzione restituisce
	se sia stata raggiunta o meno la meta.<br>
	
  <tt><b>mp_potential_step_object(x,y,stepsize,obj)</b></tt>
    Come la funzione sopra ma questa volta soltanto le istanze di <tt>obj</tt> sono
    considerate come ostacoli. <tt>obj</tt> pu&ograve; essere un oggetto o l'identificativo (id) di un'istanza.<br>
		
  <tt><b>mp_potential_settings(maxrot,rotstep,ahead,onspot)</b></tt>
    La precedente funzione opera usando un (certo) numero di parametri che possono
    essere cambiati usando questa funzione. Globalmente il metodo opera come segue. Esso 
	prima prova a muovere dritto verso la meta (obbiettivo). Esso guarda avanti di un numero di passi
	che pu&ograve; essere impostato attraverso il parametro <TT>ahead</TT> (avanti) (valore predefinito: 3).
	Ridurre questo valore comporter&agrave; che l'istanza inizi a cambiare direzione
	con pi&ugrave; ritardo. Incrementarlo comporter&agrave; che l'istanza inizi a cambiare direzione prima. Se
	questo controllo porta ad una collisione essa inizier&agrave; a guardare nelle direzioni pi&ugrave; a
	sinistra e pi&ugrave; a destra della direzione migliore. Essa fa questo in passi di
	dimensione <TT>rotstep</TT> (valore predefinito: 10). Ridurre questo valore permette all'istanza pi&ugrave;
	possibilit&agrave; di movimento ma sar&agrave; pi&ugrave; lento. Il paramentro <TT>maxrot</TT>
	&egrave; un p&ograve; pi&ugrave; difficile da spiegare. L'istanza ha una direzione corrente.
    <TT>maxrot</TT> (valore predefinito: 30) indica di quanto &egrave; possibile cambiare la sua	
    attuale direzione in un passo (step). Cos&igrave; anche se essa potesse ad esempio muovere (e.g.) dritto verso la meta (obbiettivo)
	lo farebbe soltanto se non violasse questa massima variazione di direzione.
	Se renderai <TT>maxrot</TT> grande l'istanza potr&agrave; fare grandi variazioni ad ogni passo (step).
	Questo render&agrave; pi&ugrave; facile trovare un percorso breve ma il percorso sar&agrave; pi&ugrave; brutto.
	Se rendi il valore pi&ugrave; piccolo il percorso sar&agrave; pi&ugrave; morbido ma esso potrebbe seguire
	deviazioni pi&ugrave; lunghe (e a volte anche mancare di trovare l'obbiettivo). Quando non pu&ograve; essere
	fatto nessun passo il comportamento dipender&agrave; dal valore del parametro <TT>onspot</TT>.
	Se <TT>onspot</TT> assume il valore di vero (true) (il valore predefinito), l'istanza ruoter&agrave; sul
	posto dell'ammontare indicato con <TT>maxrot</TT>. Se assume il valore di falso (false) essa 
	non si muover&agrave; affatto. Impostarla su falso (false) &egrave; utile ad esempio per (e.g.) le automobili ma riduce
	la possibilit&agrave; di trovare un percorso.<br>
</blockquote>

<p>
Per favore nota che il potenziale approccio usa solo informazioni locali. Cos&igrave; esso trover&agrave;
un percorso se queste informazioni locali sono sufficienti a determinare la giusta direzione del
movimento. Per esempio, non riuscir&agrave; a trovare un percorso di uscita di un labirinto (il pi&ugrave; delle volte).

<P>
Il secondo tipo di funzioni calcola un percorso libero da collisioni per l'istanza.
Ona volta che questo percorso &egrave; stato calcolato puoi assegnarlo all'istanza per muoverla
verso la meta. Il calcolo del percorso impiegher&agrave; del tempo ma dopo quello
l'attuazione del percorso sar&agrave; veloce. Certamente ci&ograve; varr&agrave; soltanto se 
la situazione non &egrave; cambiata nel frattempo. Per esempio, se gli ostacoli
cambiano forse avrai bisogno di ricalcolare il percorso. Ancora una volta nota che queste funzioni 
potrebbero non avere successo.
<B><I>These functions are only available in the Standard Edition of GameMaker.</I></B>

<P>
Le prime due funzioni usano l'approccio del movimento lineare e quello del campo potenziale che
venivano usati anche per le funzioni per passi (step).

<p>
<blockquote>
  <tt><b>mp_linear_path(path,xg,yg,stepsize,checkall)</b></tt>
    Questa funzione computa per l'istanza un percorso rettilineo dalla sua
    	posizione corrente alla posizione (xg,yg) usando la dimensione per passo (step) indicata.
	Esso usa i passi (step) come nella funzione <TT>mp_linear_step()</TT>. Il percorso
	indicato deve gi&agrave; esistere e sar&agrave; sovrascritto dal nuovo percorso. (Vedi in un
	capitolo successivo come creare e distruggere percorsi.) La funzione
	ritorner&agrave; se un percorso sia stato trovato. La funzione si arrester&agrave; e riporter&agrave; insuccesso
	se non esiste nessun percorso rettilineo tra il punto iniziale e la meta. Se essa fallisce
	viene tuttavia creato un percorso che vada fino alla posizione dove l'istanza si era bloccata.<br>
  <tt><b>mp_linear_path_object(path,xg,yg,stepsize,obj)</b></tt>
    Come la funzione sopra ma questa volta soltanto istanze di <tt>obj</tt> sono
    	considerate ostacoli. <tt>obj</tt> pu&ograve; essere un oggetto o un identificativo (id) di un oggetto.<br>
  <tt><b>mp_potential_path(path,xg,yg,stepsize,factor,checkall)</b></tt>
    Questa funzione computa un percorso per l'istanza dalla sua posizione corrente
 	e dal suo orientamento alla posizione (xg,yg) usando la dimensione del passo (step) indicata
	cercando di evitare collisioni con gli ostacoli. Essa usa i (possibili passi nel campo d'azione???),
	come nella funzione <TT>mp_potential_step()</TT> e anche i parametri
	che possono essere impostati con <TT>mp_potential_settings()</TT>. Il percorso indicato
	deve gi&agrave; esistere e sar&agrave; sovrascritto dal nuovo percorso. (Vedi in un
	capitolo successivo come creare e distruggere percorsi.) La funzione ritorner&agrave;
	se un percorso sia stato trovato. Per evitare che la funzione continui a calcolare
	all'infinito tu necessiti di provvedere un fattore di lunghezza (factor) maggiore di 1. La funzione
	si arrester&agrave; e riporter&agrave; insuccesso se essa non trova un percorso pi&ugrave; breve di questo
	fattore di volte la distanza tra il punto d'inizio e la meta. Un fattore del valore di 4 &egrave; solitamente
	abbastanza buono ma se ti aspetti lunghe deviazioni potresti renderlo maggiore. Se
	essa fallisce verr&agrave; tuttavia creato un percorso che vada in direzione della meta
	ma esso non la raggiunger&agrave;.<br>
  <tt><b>mp_potential_path_object(path,xg,yg,stepsize,factor,obj)</b></tt>
    Come la funzione sopra ma questa volta soltanto istanze di <tt>obj</tt> sono
    	considerate ostacoli. <tt>obj</tt> pu&ograve; essere un oggetto o un identificativo (id) di un oggetto.<br>
</blockquote>

<p>
Le altre funzioni utilizzano un meccanismo un p&ograve; pi&ugrave; complesso usando un approccio
basato su griglia (a volte chiamato un algoritmo A*). Esso avr&agrave; pi&ugrave; successo
nel trovare percorsi (anche se ancora potrebbe fallire) e trover&agrave; percorsi pi&ugrave; corti
ma esso richiede pi&ugrave; lavoro da parte tua. L'idea globale &egrave; quella che segue.
Prima di tutto noi mettiamo una griglia sulla (parte rilevante della) stanza (room). Puoi
scegliere di usare una griglia fine (che sar&agrave; pi&ugrave; lenta) o una griglia grossolana. Poi,
per tutti gli oggetti rilevanti determiniamo le celle della griglia che essi occupino (o
utilizzando i riquadri oppure il controllo preciso) e contrassegnamo queste celle come
vietate. Cos&igrave; una cella sar&agrave; segnata come completamente vietata, anche se si sovrappone
solo parzialmente ad un ostacolo. Infine specifichiamo un punto d'inizio e una posizione
meta (che deve trovarsi in celle libere) e la funzione computa il 
percorso pi&ugrave; breve (effettivamente vicino al pi&ugrave; corto) tra questi. Il percorso
andr&agrave; tra i centri delle celle libere. Cos&igrave; se le celle sono grandi abbastanza
da fare in modo che l'istanza posizionata nel loro centro andr&agrave; completamente all'interno
questo avr&agrave; successo. Questo percorso adesso puoi fornirlo da seguire ad
ad un'istanza.

<P>
L'approccio basato su griglia &egrave; molto potente (ed &egrave; usato in molti giochi
professionali) ma esso richiede che tu faccia alcune attente riflessioni. Devi determinare
quale area e quale dimensione delle celle siano abbastanza buone per risolvere il gioco. Inoltre devi
determinare quali oggetti debbano essere evitati e se il controllo preciso (precise checking) sia
importante. Tutti questi parametri influenzano fortemente l'efficienza dell'approccio.

<P>
In particolare la dimensione delle celle &egrave; cruciale. Ricorda che le celle
devono essere larghe abbastanza da fare in modo che l'oggetto in movimento posizionato con la sua origine
al centro della cella vada completamente all'interno della cella stessa. (Fai attenzione
alla posizione dell'origine dell'oggetto. Inoltre ricorda che puoi
spostare il percorso se l'origine dell'oggetto non si trova nel suo centro!) D'altra parte,
pi&ugrave; piccole le celle pi&ugrave; possibili percorsi esistono. Se 
rendi le celle troppo grandi, aperture tra gli ostacoli potrebbero rimanere chiuse perch&egrave;
tutte le celle intersecano un ostacolo.

<p>
Le attuali funzioni per l'approccio basato sulla griglia sono le seguenti:

<p>
<blockquote>
  <tt><b>mp_grid_create(left,top,hcells,vcells,cellwidth,cellheight)</b></tt>
    Questa funzione crea la griglia. Essa restituisce un indice che deve essere usato in
    	tutte le altre chiamate. Puoi creare e mantenere pi&ugrave; strutture di griglia allo
	stesso tempo. left (sinistra) e top (sopra) indicano la posizione dell'angolo in alto a sinistra
	della griglia. hcells e vcells indicano il numero delle celle orizzontali e
	verticali. Infine cellwidth (larghezza della cella) e cellheight (altezza della cella) indicano la dimensione delle celle.<br>
  <tt><b>mp_grid_destroy(id)</b></tt>
    Distrugge la struttura di griglia e libera la memoria che occupava. Non dimenticarti
    	di chiamarla se non necessiti pi&ugrave; della struttura.<br>
  <tt><b>mp_grid_clear_all(id)</b></tt>
    Segna tutte le celle della griglia come libere.<br>
  <tt><b>mp_grid_clear_cell(id,h,v)</b></tt>
    Libera la cella indicata. La cella 0,0 &egrave; la cella in alto a sinistra.<br>
  <tt><b>mp_grid_clear_rectangle(id,left,top,right,bottom)</b></tt>
    Libera tutte le celle che intersecano il rettangolo indicato (in coordinate della stanza (room)).<br>
  <tt><b>mp_grid_add_cell(id,h,v)</b></tt>
    Segna la cella indicata come vietata. La cella 0,0 &egrave; la cella in alto a sinistra.<br>
  <tt><b>mp_grid_add_rectangle(id,left,top,right,bottom)</b></tt>
    Segna tutte le celle che intersecano il rettangolo indicato come vietate.<br>
  <tt><b>mp_grid_add_instances(id,obj,prec)</b></tt>
    Segna tutte le celle che intersecano un istanza dell'oggetto indicato come
    	vietate. Puoi anche usare un istanza individuale rendendo obj
	l'identificativo (id) dell'istanza. Inoltre puoi usare la parola chiave <TT><B>all</b></tt>
    per indicare tutte le istanze di tutti gli oggetti. prec indica se debba essere
    usato il controllo preciso (precise checking) (funzioner&agrave; soltanto se il controllo preciso 
    &egrave; abilitato per lo sprite usato dall'istanza).<br>
  <tt><b>mp_grid_path(id,path,xstart,ystart,xgoal,ygoal,allowdiag)</b></tt>
    Computa un percorso attraverso la griglia. path (percorso) deve indicare un percorso esistente che
    	verr&agrave; sostituito dal percorso computato. xstart e ystart indicano il punto d'inizio
	del percorso e xgoal e ygoal la meta. allowdiag indica se
	sono consentiti movimenti diagonali invece dei soli orizzontali o verticali. La
	funzione restituisce se &egrave; riuscita a trovare un percorso. (Nota che il 
	percorso &egrave; indipendente dalla corrente istanza; Esso &egrave; un percorso attraverso la
	griglia, non un percorso per una specifica istanza.) <br>
  <tt><b>mp_grid_draw(id)</b></tt>
    Questa funzione disegna la griglia con le celle libere di colore verde e le celle vietate di colore
    	rosso. Questa funzione &egrave; lenta ed &egrave; fornita solo come strumento per rilevare errori (debug).<br>
</blockquote>


<!--END-->
</body>
</html>

<!-- KEYWORDS
motion planning
potential fields
A* algorithm
finding paths

mp_linear_step()
mp_potential_step()
mp_linear_step_object()
mp_potential_step_object()
mp_potential_settings()
mp_linear_path() 
mp_potential_path() 
mp_linear_path_object() 
mp_potential_path_object() 
mp_grid_create()
mp_grid_destroy()
mp_grid_clear_all()
mp_grid_clear_cell()
mp_grid_clear_rectangle()
mp_grid_add_cell()
mp_grid_add_rectangle()
mp_grid_add_instances()
mp_grid_path()
mp_grid_draw()

path finding
movimento pianificato

algoritmo A*
A star
ricerca dei percorsi
--> 
