<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Code di priorit&agrave;</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->

<h3>Code di priorit&agrave;</h3>

In una coda di priorit&agrave; vengono memorizzati diversi valori, ciascuno 
con una priorit&agrave;. &Egrave; possibile trovare rapidamente i valori 
con minima e massima priorit&agrave;. Questa struttura pu&ograve; 
essere molto utile per la costruzione di classifiche o liste di 
informazioni in cui l'importanza di ogni voce pu&ograve; essere ponderata. 
Le seguenti funzioni sono disponibili:

<p>
<blockquote>
  <tt><b>ds_priority_create()</b></tt> 
    Crea una nuova coda di priorit&agrave;. La funzione restituisce un intero come un id che 
    deve essere utilizzato in tutte le altre funzioni per accedere a particolari code di priorit&agrave;.<br>
  <tt><b>ds_priority_destroy(id)</b></tt> 
    Distrugge la coda di priorit&agrave; dato il suo id, liberando la memoria utilizzata. Non 
    dimenticate di chiamare questa funzione quando si &egrave; pronti con la struttura.<br>
  <tt><b>ds_priority_clear(id)</b></tt> 
    Azzera la coda di priorit&agrave; dato il suo id, 
    rimuovendo tutti i dati da essa, ma senza distruggerla.<br>
  <tt><b>ds_priority_copy(id,source)</b></tt> 
    Copia il contenuto della coda di priorit&agrave; nella coda di cui &egrave; dato l'id.<br>
  <tt><b>ds_priority_size(id)</b></tt> 
    Restituisce il numero di valori memorizzati nella coda di priorit&agrave;.<br>
  <tt><b>ds_priority_empty(id)</b></tt> 
    Restituisce un valore se la coda di priorit&agrave; &egrave; vuota. &Egrave; come testare se la dimensione &egrave; 0.<br>
  <tt><b>ds_priority_add(id,val,prio)</b></tt> 
    Aggiunge un valore (val) con priorit&agrave; (prio) alla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_change_priority(id,val,prio)</b></tt> 
    Cambia la priorit&agrave; del valore indicato nella coda di priorit&agrave;.<br>
  <tt><b>ds_priority_find_priority(id,val)</b></tt> 
    Restituisce la priorit&agrave; del valore indicato nella coda di priorit&agrave;.<br>
  <tt><b>ds_priority_delete_value(id,val)</b></tt> 
    Cancella il valore (con la sua priorit&agrave;) dalla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_delete_min(id)</b></tt> 
    Restituisce il valore con la minor priorit&agrave; e lo elimina dalla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_find_min(id)</b></tt> 
    Restituisce il valore con la minor priorit&agrave;, ma non lo cancella dalla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_delete_max(id)</b></tt> 
    Restituisce il valore con la pi&ugrave; grande priorit&agrave; e lo elimina dalla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_find_max(id)</b></tt> 
   Restituisce il valore con la pi&ugrave; grande priorit&agrave;, ma non lo cancella dalla coda di priorit&agrave;.<br>
  <tt><b>ds_priority_write(id)</b></tt> 
    Converte la struttura dati in una stringa e restituisce questa stringa. La stringa 
    pu&ograve; quindi essere utilizzata, per esempio, per essere salvata in un file. Questa funzione 
    fornisce un semplice meccanismo per salvare strutture dati.<br>
  <tt><b>ds_priority_read(id,str)</b></tt> 
    Legge la struttura dati dalla stringa passata come parametro 
    (che pu&ograve; essere creata usando la chiamata precedente).<br>
</blockquote>

<!--END-->
</body>
</html>

<!-- KEYWORDS
priority queues

code di priorit&agrave;

ds_priority_create()
ds_priority_destroy()
ds_priority_clear()
ds_priority_copy()
ds_priority_size()
ds_priority_empty()
ds_priority_add()
ds_priority_change_priority()
ds_priority_find_priority()
ds_priority_delete_value()
ds_priority_delete_min()
ds_priority_find_min()
ds_priority_delete_max()
ds_priority_find_max()
ds_priority_write()
ds_priority_read()
--> 
