<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Usare le DLL</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">
<!--START-->

<h1>Usare le DLL</h1>

<i><b>Questa funzionalit&agrave; &egrave; disponibile sono nella Standard Edition di Game Maker.</b></i>


<p>
<i><b>Ricorda che dalla versione 7 c'&egrave; un nuovo meccanismo per le estensioni.
&Egrave; meglio utilizzare il meccanismo delle estensioni, piuttosto che le funzioni
descritte in questa sezione.
Vedi
<a href="http://www.yoyogames.com/extensions" target="_blank">http://www.yoyogames.com/extensions</a>
per i dettagli.
Queste funzioni vengono mantenute principalmente per compatibilit&agrave;
con il passato.</b></i>


<p>
In quei casi in cui le funzionalit&agrave; del GML non sono sufficienti,
puoi estendere le possibilit&agrave; usando i plug-ins. Un plug-in
nella forma di file DLL (una libreria a collegamento dinamico. In un file DLL
puoi definire delle funzioni. Queste funzioni possono essere scritte in qualunque
linguaggio di programmazione che supporta la creazione di DLL (Delphi, C, C++, ecc.)
Dovrai comunque aver bisogno di esperienza con la programmazione per fare ci&ograve;.
Le funzioni esterne devono avere un formato specifico. Possono avere da 0 a 16
argomenti, ognuno dei quali pu&ograve; essere un numero reale (double sul C) oppure
una stringa null-terminated (che termina con il carattere \0). (Per pi&ugrave; di 4 argomenti,
sono supportati solo i numeri reali al momento). Esse devono ritornare
un numero reale o una stringa null-terminated.

<p>
Nel Delphi puoi creare una DLL scegliendo prima <b>New</b>
dal menu <b>File</b> e dopo scegliere DLL. Qui
c'&egrave; un esempio di una DLL che puoi usare con <i>GameMaker</i>
scritto in Delphi. (Nota che questo &egrave; del codice Delphi,
non GML!)

<p>
<blockquote>
<pre>
library MyDLL;

uses SysUtils, Classes;

function MyMin(x,y:double):double;  cdecl;
begin
  if x&lt;y then Result := x else Result := y;
end;

var res : array[0..1024] of char;

function DoubleString(str:PChar):PChar; cdecl;
begin
  StrCopy(res,str);
  StrCat(res,str);
  Result := res;
end;

exports MyMin, DoubleString;

begin
end.
</pre>
</blockquote>

<p>
Questa DLL definisce due funzioni: <tt>MyMin</tt> prende due argomenti reali
e restituisce il minore tra i due, e <tt>DoubleString</tt>
raddoppia la stringa. Nota che devi fare attenzione con la gestione della memoria.
Questo &egrave; il motivo per cui ho dichiarato la stringa risultante globale.
Inoltre ricorda l'uso della convezione per le chiamate "cdecl". Puoi
usare sia cdecl che stdcall. Dopo che hai creato
la DLL in Delphi otterrai un file chiamato <tt>MyDLL.DLL</tt>. Questo
file dev'essere piazzato nella directory di esecuzione del tuo gioco.
(O in qualunque altro posto in cui Windows pu&ograve; trovarlo).

<p>
Per usare questa DLL su <i>GameMaker</i> devi prima specificare
le funzioni esterne che vuoi utilizzare e quali tipi di argomenti
prendono. Per questo c'&egrave; la seguente funzione GML:

<p>
<blockquote>
  <tt><b>external_define(dll,name,calltype,restype,argnumb,arg1type,arg2type, ...)</b></tt> 
	Definisce una funzione esterna. dll &egrave; il nome del file DLL.
	name &egrave; il nome della funzione. calltype &egrave; la convenzione per le chiamate
	da usare. Per questa puoi mettere sia dll_cdecl che dll_stdcall. restype &egrave;
	il tipo del risultato. Per questo puoi usare ty_real o ty_string. argnumb
	&egrave; il numero di argomenti (0-16). Poi, per ogni argomento devi
	specificare il suo tipo, usando ty_real o ty_string.
	Quando ci sono pi&ugrave; di 4 argomenti, devono essere tutti ty_real.<br>
</blockquote>

<p>
Questa funzione restituisce l'id della funzione esterna che
dev'essere utilizzata per chiamarla. Dunque nell'esempio sovrastante, 
all'inizio del gioco utililzzeresti il seguente codice GML:

<p>
<blockquote>
<pre>
{
  global.mmm = external_define('MyDLL.DLL','MyMin',dll_cdecl,
                                     ty_real,2,ty_real,ty_real);
  global.ddd = external_define('MyDLL.DLL','DoubleString',dll_cdecl,
                                     ty_string,1,ty_string);
}
</pre>
</blockquote>

<p>
Adesso ogni volta che avrai bisogno di chiamare la funzione, dovrai usere la seguente:

<p>
<blockquote>
  <tt><b>external_call(id,arg1,arg2,...)</b></tt> 
	Chiama la funzione esterna con l'id indiciato, e
	gli argomenti dati. Devi inserire il numero corretto di argomenti
	del tipo corretto (reale o stringa). La funzione restituisce
	il risultato della funzione esterna.<br>
</blockquote>

<p>
Dunque, per esempio, scriveresti:

<p>
<blockquote>
<pre>
{
  aaa = external_call(global.mmm,x,y);
  sss = external_call(global.ddd,'Hello');
}
</pre>
</blockquote>

<p>
Se non hai pi&ugrave; bisogno di utilizzare la DLL &egrave; meglio se liberi la sua memoria.

<p>
<blockquote>
  <tt><b>external_free(dll)</b></tt> 
	Libera la memoria della DLL con il nome dato. Questo &egrave; particolarmente
	necessario se il gioco deve rimuovere la DLL. FInch&egrave; la DLL non viene liberata
	non pu&ograve; essere rimossa. &Egrave; meglio fare ci&ograve; in un evento di fine gioco.<br>
</blockquote>

<p>
Potresti chiederti come fare una funzione in una DLL che
fa qualcosa nel gioco. Per esempio, potresti voler creare
una DLL che aggiunge istanze di oggetto nel tuo gioco. Il modo pi&ugrave; semplice per farlo
&egrave; usare una funzione della DLL che restituisce una stringa che
contiene un pezzo di codice GML. Questa stringa che contiene
il codice GML pu&ograve; essere eseguita con la funzione GML:

<p>
<blockquote>
  <tt><b>execute_string(str,arg0,arg1,...)</b></tt> 
	Esegue il pezzo di codice nella stringa str con gli argomenti indicati.<br>
</blockquote>

<p>
Alternativamente puoi far creare alla DLL un file con
uno script che dev'essere eseguito (questa funzione pu&ograve; anche essere
usata per modificare successivamente il comportamento di un gioco).

<p>
<blockquote>
  <tt><b>execute_file(fname)</b></tt> 
	Esegue il pezzo di codice nel file.<br>
</blockquote>

<p>
Adesso puoi chiamare una funzione esterna e dunque eseguire la stringa risultante: 

<p>
<blockquote>
<pre>
{
  ccc = external_call(global.ddd,x,y);
  execute_string(ccc);
}
</pre>
</blockquote>

<p>
In alcuni rari casi la tua DLL potrebbe aver bisogno di conoscere l'handle della
finestra grafica principale del gioco. Questa pu&ograve; essere ottenuta con la seguente
funzione e pu&ograve; dunque essere passata alla DLL:

<p>
<blockquote>
  <tt><b>window_handle()</b></tt> 
	Restituisce l'handle della finestra principale.<br>
</blockquote>

<p>
Nota che le DLL non possono essere eseguite in modalit&agrave; sicura.

<p>
Usare le DLL esterne &egrave; un meccanismo estremamente potente.
Ma per favore utilizzalo solo se sai ci&ograve; che stai facendo.

<p>
<blockquote>
  <tt><b>get_function_address('function_name')</b></tt> 
	Restituisce l'indirizzo di una funzione GameMaker. Questo pu&ograve; essere passato
	alla DLL in modo da chiamarla direttamente su GameMaker.
	This feature is unsuported, so care must be taken when using this function.<br>
	Questa funzionalit&agrave; non &egrave; supportata, quindi bisogna fare attenzione quando
	si utilizza questa funzione.<br>
	Per favore nota che queste funzioni usano la convenzione per le chiamate "Delphi 2010 PASCAL", lo stesso per il formato delle stringhe.</b><br>
</blockquote>


<!--END-->
</body>
</html>

<!-- KEYWORDS
DLL
plug-in
external functions
Delphi
C++
extending GameMaker
adding functionality
window handle
executing strings
executing external scripts
executing files

funzioni esterne
estendere GameMaker
aggiungere funzionalit&agrave;
handle della finestra
eseguire stringhe
eseguire script esterni
eseguire files

external_call()
external_define()
external_free()
window_handle()
get_function_address()
ty_real
ty_string
dll_cdecl
dll_stdcall
--> 
