<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">

<html>
<head>
<title>Andare in modalit&agrave; 3D</title>
<link href="style.css" rel="stylesheet" type="text/css">
</head>
<body background="images/back.gif">

<!--START-->

<h3>Andare in modalit&agrave; 3D</h3>

Se si desidera utilizzare la modalit&agrave; 3D &egrave; necessario innanzitutto impostare <i>GameMaker</i> in modalit&agrave; 3D. 
Successivamente sar&agrave; possibile tornare alla modalit&agrave; 2D, se lo si desidera. Le seguenti due funzioni 
esistono per questo.

<p>
<blockquote>
  <tt><b>d3d_start()</b></tt>
    Inizia la modalit&agrave; 3D. Ritorna se ha avuto successo.<br>
  <tt><b>d3d_end()</b></tt>
    Termina la modalit&agrave; 3D. Ritorna se ha avuto successo.<br>
</blockquote>

<p>
Notare che tutte le funzioni che riguardano la modalit&agrave; 3D cominciano con <tt>d3d_</tt>. 

<p>
L'avvio della modalit&agrave; 3D comporter&agrave; le seguenti modifiche. Innanzitutto il depth testing (test 
della profondit&agrave;, noto anche come z-buffer) &egrave; attivato (usando un 24-bit z-buffer). Ci&ograve; significa
che per ogni pixel sullo schermo solo quelli col pi&ugrave; piccolo valore z (profondit&agrave; = valore) verranno 
disegnati. Se delle istanze hanno la stessa profondit&agrave; allora si otterr&agrave; ci&ograve; che &egrave; noto come z-fighting. 
Questo accade quando si tenta di disegnare due istanze allo stesso livello, e l'imprecisione nel 
rendering, dovuta a vicinissimi valori z, causa brutti effetti. Per evitare questo, assicurarsi sempre 
che due istanze non abbiano lo stesso valore di profondit&agrave;!

<p>
In secondo luogo, la normale proiezione ortogonale &egrave; sostituita da una prospettica. Ci&ograve; significa 
quanto segue. Normalmente la dimensione delle istanze sullo schermo non dipende dalla loro profondit&agrave;. 
Con una proiezione prospettica istanze che hanno grandi valori di profondit&agrave; appariranno pi&ugrave; piccole. 
Quando la profondit&agrave; &egrave; 0, &egrave; uguale alla vecchia dimensione (senza che si cambi proiezione). Il punto 
di vista della telecamera &egrave; posto ad una certa distanza sopra la room. (Questa distanza &egrave; uguale alla larghezza 
della room, che d&agrave; una proiezione ragionevole di default.) Solo le istanze di fronte alla telecamera sono 
disegnate. Quindi non utilizzare istanze con una profondit&agrave; minore di 0 (o almeno non minore di w, dove w 
&egrave; la larghezza della room o della view).

<p>
In terzo luogo, la coordinata verticale y &egrave; invertita. Mentre normalmente la posizione (0,0) &egrave; in alto a 
sinistra della vista, in modalit&agrave; 3D la posizione (0,0) &egrave; in basso a sinistra, come &egrave; nelle normali 
viste tridimensionali.

<p>
Si possono effettivamente cambiare superfici nascoste da rimuovere e attivare o disattivare proiezioni 
prospettiche mediante le seguenti funzioni.
	
<p>
<blockquote>
  <tt><b>d3d_set_hidden(enable)</b></tt> Abilita (true) o disabilita (false) il depth testing.<br>
  <tt><b>d3d_set_perspective(enable)</b></tt>
    Abilita l'utilizzo di una proiezione prospettica (true), o lo disabilita (false).<br>
</blockquote>


<!--END-->

</body>
</html>

<!-- KEYWORDS
hidden surface removal
z-buffer

rimozione delle superfici nascoste

d3d_start()
d3d_end()
d3d_set_hidden()
d3d_set_perspective()

--> 
